namespace SelfCSharp.Chap10
{

    internal class DelegateLambda
    {
        // 
        void ArrayWalk(string[] data, Func<string, string> output)
        {
            foreach (string value in data)
            {
                Console.WriteLine(output(value));
            }
        }


        static void Main(string[] args)
        {
            var data = new[] { "あかまきがみ", "あおまきがみ", "きまきがみ" };

            var dl = new DelegateLambda();

            //--------------------------------------------------------------------------
            // デリゲート
            //--------------------------------------------------------------------------
            dl.ArrayWalk(
                data,
                delegate (string str)
                {
                    return $"[{str}]";
                }
            );

            //--------------------------------------------------------------------------
            // ラムダ式（匿名メソッドをより簡素に）
            //--------------------------------------------------------------------------
            dl.ArrayWalk(
                data,
                (string s) =>
                {
                    return $"[{s}]";
                }
            );

            //--------------------------------------------------------------------------
            // 本体が一文である場合には、ブロックを表す {...} は省略可能。
            // また文の戻り値がそのまま戻り値とみなされるので、return命令も省略可能。
            //--------------------------------------------------------------------------
            dl.ArrayWalk(data, (string s) => $"[{s}]" );

            //--------------------------------------------------------------------------
            // 引数の型は暗黙的に推論されるので、ラムダ式では略記するのが普通。
            //--------------------------------------------------------------------------
            dl.ArrayWalk(data, (s) => $"[{s}]");

            //--------------------------------------------------------------------------
            // 引数が1個の場合には、引数をくくるカッコも省略可能。
            //--------------------------------------------------------------------------
            dl.ArrayWalk(data, s => $"[{s}]");

            //--------------------------------------------------------------------------
            // 引数が無い場合にはカッコを省略できない。
            //--------------------------------------------------------------------------
            Action act = () => Console.WriteLine("こんにちは、世界！");
        }
    }
}
