using System;
using System.Globalization;

namespace SelfCSharp.Chap05
{
    internal class DateTimeOperation
    {
        static void Main(string[] args)
        {
            var dt = new DateTime();
            var strDt = string.Empty;
            var strResult = string.Empty;
            var isResult = false;

            //-------------------------------------------------------------------------------------------
            // 日付／時刻オブジェクトを生成する
            //-------------------------------------------------------------------------------------------
            //----------------------------------------------------------
            // (1) 現在の日付／時刻から生成する
            //----------------------------------------------------------
            Console.WriteLine( DateTime.Now );      // 結果：2025/11/26 15:36:34
            Console.WriteLine( DateTime.Today );    // 結果：2025/11/26 0:00:00
            Console.WriteLine("--------------------------------------------------------------------------");

            //----------------------------------------------------------
            // (2) 指定された年月日、時分秒から生成する
            //----------------------------------------------------------
            //                               年   月  日  時  分  秒
            Console.WriteLine( new DateTime(2022, 02, 15, 13, 17, 23) );    // 結果：2022/02/15 13:17:23
            Console.WriteLine("--------------------------------------------------------------------------");

            //----------------------------------------------------------
            // (3) 日付／時刻文字列から変換する
            //----------------------------------------------------------
            strDt = "2022/02/15 13:17:23";
            dt = DateTime.Parse( strDt );
            Console.WriteLine( dt );

        }
    }
}
