using System;

namespace SelfCSharp.Chap02
{
    internal class ArrayMulti
    {
        static void Main(string[] args)
        {
            //-------------------------------------------------------------------------------------------
            // 2次元配列
            //-------------------------------------------------------------------------------------------
            int[,] arr2 =
            {
                { 10, 11, 12 },
                { 20, 21, 22 },
            };
            // 2次元配列（var）
            var arr2var = new int[,] 
            {
                { 10, 11, 12 },
                { 20, 21, 22 },
            };

            for (var i = 0; i < arr2.GetLength(0); i++)
            {
                for(var j = 0; j < arr2.GetLength(1); j++)
                {
                    Console.WriteLine($"arr2[{i}, {j}]：{arr2[i,j]}");
                }
            }
            Console.WriteLine("--------------------------------------------------------------------------");

            //-------------------------------------------------------------------------------------------
            // 3次元配列
            //-------------------------------------------------------------------------------------------
            string[,,] arr3 =
            {
                //[0]
                {
                    //[0]
                    { 
                        //[0]      [1]        [2]
                        "S梨",     "Sりんご", "S柿" 
                    },
                    //[1]
                    { 
                        //[0]      [1]        [2]
                        "S桃",     "Sバナナ", "Sキウイ" 
                    },
                    //[2]
                    { 
                        //[0]      [1]        [2]
                        "Sみかん", "Sいちご", "Sパイン" 
                    },
                },
                //[1]
                {
                    //[0]
                    { 
                        //[0]      [1]        [2]
                        "M梨",     "Mりんご", "M柿" 
                    },
                    //[1]
                    { 
                        //[0]      [1]        [2]
                        "M桃",     "Mバナナ", "Mキウイ" 
                    },
                    //[2]
                    { 
                        //[0]      [1]        [2]
                        "Mみかん", "Mいちご", "Mパイン" 
                    },
                },
                //[2]
                {
                    //[0]
                    { 
                        //[0]      [1]        [2]
                        "L梨",     "Lりんご", "L柿" 
                    },
                    //[1]
                    { 
                        //[0]      [1]        [2]
                        "L桃",     "Lバナナ", "Lキウイ" 
                    },
                    //[2]
                    { 
                        //[0]      [1]        [2]
                        "Lみかん", "Lいちご", "Lパイン" 
                    },
                },
            };

            for (var i = 0; i < arr3.GetLength(0); i++)
            {
                for (var j = 0; j < arr3.GetLength(1); j++)
                {
                    for (var k = 0; k < arr3.GetLength(2); k++)
                    {
                        Console.WriteLine($"arr3[{i}, {j}, {k}]：{arr3[i, j, k]}");
                    }
                }
            }
            Console.WriteLine("--------------------------------------------------------------------------");

            //-------------------------------------------------------------------------------------------
            // ジャグ配列
            //-------------------------------------------------------------------------------------------
            int[][] jagArrA = new int[3][];
            jagArrA[0] = new int[2];
            jagArrA[1] = new int[4];
            jagArrA[2] = new int[3];

            // ジャグ配列に対して初期値を引き渡す
            int[][] jagArrB = new int[3][];
            jagArrA[0] = new[] { 10, 11, 12, 13, 14 };
            jagArrA[1] = new[] { 20, 21, 22 };
            jagArrA[2] = new[] { 30, 31, 32, 33 };

            // ジャグ配列の宣言＋初期化
            var jagArrC = new int[3][]
            {
                new[] { 10, 11, 12, 13, 14 },
                new[] { 20, 21, 22 },
                new[] { 30, 31, 32, 33 },
            };

            for (var i = 0; i < jagArrC.Length; i++)
            {
                for (var j = 0; j < jagArrC[i].Length; j++)
                {
                    Console.WriteLine($"jagArrC[{i}][{j}]：{jagArrC[i][j]}");
                }
                Console.WriteLine("--------");
            }
            Console.WriteLine("--------------------------------------------------------------------------");

            //----------------------------------------------------------
            // Lengthプロパティ（多次元配列では、Lengthプロパティは配列内のすべての要素数を返す）
            //----------------------------------------------------------
            Console.WriteLine(arr2.Length);    // 結果：6
            Console.WriteLine(jagArrC.Length); // 結果：3  → ジャグ配列はあくまで「要素が配列である」１次元配列。変数jagArrCはint[]型の要素を３個持っている。
            Console.WriteLine("--------");

            //----------------------------------------------------------
            // Rankプロパティ（次元数を取得する）
            //----------------------------------------------------------
            Console.WriteLine(arr2.Rank);    // 結果：2    多次元配列（2次元配列）
            Console.WriteLine(jagArrC.Rank); // 結果：1    ジャグ配列（1次元配列）
            Console.WriteLine("--------------------------------------------------------------------------");


            string str = "あいうえお";
            Console.WriteLine( str[0].ToString() );       // 結果：あ（先頭の1文字）
            Console.WriteLine( str[1..3].ToString() );    // 結果：いう
            Console.WriteLine( str[^1].ToString() );      // 結果：お（末尾の1文字）
        }
    }
}
